AOG-addendum/esp32-autosteer/src/main.cpp
    ESPUI.addControl( ControlType::Label, "OTA Update:", "<a href='/update'>Update</a>", ControlColor::Carrot, tab );

    ESPUI.addControl( ControlType::Label, "Download the config:", "<a href='config.json'>Configuration</a>", ControlColor::Carrot, tab );

    ESPUI.addControl( ControlType::Label, "Upload the config:", "<form method='POST' action='/upload-config' enctype='multipart/form-data'><input name='f' type='file'><input type='submit'></form>", ControlColor::Carrot, tab );

    ESPUI.addControl( ControlType::Label, "Download the calibration:", "<a href='calibration.json'>Calibration</a>", ControlColor::Carrot, tab );

    ESPUI.addControl( ControlType::Label, "Upload the calibration:", "<form method='POST' action='/upload-calibration' enctype='multipart/form-data'><input name='f' type='file'><input type='submit'></form>", ControlColor::Carrot, tab );
    // onchange='this.form.submit()'
    {
      ESPUI.addControl( ControlType::Switcher, "Retain WIFI settings", steerConfig.retainWifiSettings ? "1" : "0", ControlColor::Peterriver, tab,
      []( Control * control, int id ) {
        steerConfig.retainWifiSettings = control->value.toInt() == 1;
      } );
    }
    {
      ESPUI.addControl( ControlType::Button, "Set Settings To Default*", "Defaults", ControlColor::Wetasphalt, tab,
      []( Control * control, int id ) {
        char ssid[24], password[24], hostname[24];

        if( steerConfig.retainWifiSettings ) {
          memcpy( ssid, steerConfig.ssid, sizeof( ssid ) );
          memcpy( password, steerConfig.password, sizeof( password ) );
          memcpy( hostname, steerConfig.hostname, sizeof( hostname ) );
        }

        steerConfig = steerConfigDefaults;

        if( steerConfig.retainWifiSettings ) {
          memcpy( steerConfig.ssid, ssid, sizeof( ssid ) );
          memcpy( steerConfig.password, password, sizeof( password ) );
          memcpy( steerConfig.hostname, hostname, sizeof( hostname ) );
        }

        setResetButtonToRed();
      } );
    }

    tabConfigurations = tab;

  }

  i2cMutex = xSemaphoreCreateMutex();

  /*
  * .begin loads and serves all files from PROGMEM directly.
  * If you want to serve the files from SPIFFS use ESPUI.beginSPIFFS
  * (.prepareFileSystem has to be run in an empty sketch before)
  */

  /*
  * Optionally you can use HTTP BasicAuth. Keep in mind that this is NOT a
  * SECURE way of limiting access.
  * Anyone who is able to sniff traffic will be able to intercept your password
  * since it is transmitted in cleartext. Just add a username and password,
  * for example begin("ESPUI Control", "username", "password")
  */
  static String title;

  if( steerConfig.mode == SteerConfig::Mode::QtOpenGuidance ) {
    title = "QOG Control :: ";
  }

  if( steerConfig.mode == SteerConfig::Mode::AgOpenGps ) {
    title = "AOG Control :: ";
  }

  title += steerConfig.hostname;

  ESPUI.begin( title.c_str() );

  ESPUI.server->on( "/config.json", HTTP_GET, []( AsyncWebServerRequest * request ) {
    request->send( SPIFFS, "/config.json", "application/json", true );
  } );
  ESPUI.server->on( "/calibration.json", HTTP_GET, []( AsyncWebServerRequest * request ) {
    request->send( SPIFFS, "/calibration.json", "application/json", true );
  } );

  // upload a file to /upload-config
  ESPUI.server->on( "/upload-config", HTTP_POST, []( AsyncWebServerRequest * request ) {
    request->send( 200 );
  }, [tabConfigurations]( AsyncWebServerRequest * request, String filename, size_t index, uint8_t* data, size_t len, bool final ) {
    if( !index ) {
      request->_tempFile = SPIFFS.open( "/config.json", "w" );
    }

    if( request->_tempFile ) {
      if( len ) {
        request->_tempFile.write( data, len );
      }

      if( final ) {
        request->_tempFile.close();
        setResetButtonToRed();
        String str( "/#tab" );
        str += tabConfigurations;
        request->redirect( str );
      }
    }
  } );

  // upload a file to /upload-calibration
  ESPUI.server->on( "/upload-calibration", HTTP_POST, []( AsyncWebServerRequest * request ) {
    request->send( 200 );
  }, [tabConfigurations]( AsyncWebServerRequest * request, String filename, size_t index, uint8_t* data, size_t len, bool final ) {
    if( !index ) {
      request->_tempFile = SPIFFS.open( "/calibration.json", "w" );
    }

    if( request->_tempFile ) {
      if( len ) {
        request->_tempFile.write( data, len );
      }

      if( final ) {
        request->_tempFile.close();
        setResetButtonToRed();
        String str( "/#tab" );
        str += tabConfigurations;
        request->redirect( str );
      }
    }
  } );

  if( steerConfig.enableOTA ) {
    AsyncElegantOTA.begin( ESPUI.server );
  }

  initIdleStats();

  initSensors();

  initCan();

  initAutosteer();
}

void loop( void ) {
  dnsServer.processNextRequest();
  vTaskDelay( 100 );
}
